In [1]:
import pandas as pd
import numpy as np
import math

1.	Получить файл (Titanic.csv) набора данных, прилагающийся к этой работе.
2.	Считать файл в pandas DataFrame

In [2]:
titanic = pd.read_csv('titanic.csv')
titanic.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

3.	Ознакомиться с основными параметрами датасета, используя функции библиотеки pandas, включая следующие данные:

a.	Количество точек данных (измерений) в наборе

In [3]:
titanic.shape[0]

1313

b.	Количество полей данных (атрибутов)

In [4]:
titanic.shape[1]

5

c.	Тип данных каждого поля, шкала каждого поля

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
Name        1313 non-null object
PClass      1312 non-null object
Age         756 non-null float64
Sex         1313 non-null object
Survived    1313 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

In [6]:
pd.Series({i: titanic[i].unique() for i in titanic})

Name        [Allen, Miss Elisabeth Walton, Allison, Miss H...
PClass                                   [1st, 2nd, nan, 3rd]
Age         [29.0, 2.0, 30.0, 25.0, 0.92, 47.0, 63.0, 39.0...
Sex                                            [female, male]
Survived                                               [1, 0]
dtype: object

d.	Количество отсутствующих значений для каждого поля

In [7]:
titanic.isnull().sum()

Name          0
PClass        1
Age         557
Sex           0
Survived      0
dtype: int64

e.	Количество и названия константных и уникальных полей

Константные поля: 3 (PClass, Sex, Survived)

Уникальные поля: 1 (Name)

4.	Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения

In [8]:
titanic.drop('Name', axis=1, inplace=True)

In [9]:
titanic.head()

  PClass    Age     Sex  Survived
0    1st  29.00  female         1
1    1st   2.00  female         0
2    1st  30.00    male         0
3    1st  25.00  female         0
4    1st   0.92    male         1

5.	Заменить возраст пассажиров на год рождения

In [10]:
titanic['Age'] = 1912 - titanic['Age'].map(math.ceil, na_action='ignore')
titanic.rename(columns= {'Age': 'YearOfBirth'}, inplace=True)

In [11]:
titanic.head()

  PClass  YearOfBirth     Sex  Survived
0    1st       1883.0  female         1
1    1st       1910.0  female         0
2    1st       1882.0    male         0
3    1st       1887.0  female         0
4    1st       1911.0    male         1

6.	Переименовать все названия колонок на русском языке

In [12]:
#все колонки уже не на русском языке

7.	Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [13]:
titanic.isnull().sum()

PClass           1
YearOfBirth    557
Sex              0
Survived         0
dtype: int64

In [14]:
titanic.fillna(round(titanic.mean()), inplace=True)
titanic = titanic.astype({'YearOfBirth': "Int64"})
titanic['PClass'].fillna(titanic['PClass'].mode()[0], inplace=True)

In [15]:
titanic.isnull().sum()

PClass         0
YearOfBirth    0
Sex            0
Survived       0
dtype: int64

8.	Сохранить получившийся набор данных в формате CSV в файле ФИО_Titanic.csv

In [16]:
titanic.to_csv('КрыловаЕлизаветаАлексеевна_Titanic.csv', index=False)

9.	Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx

10.	Считать файл .xlsx в новый DataFrame

In [17]:
titanic_new = pd.read_excel('КрыловаЕлизаветаАлексеевна_Titanic.xlsx')
titanic_new.head()

  PClass   Age     Sex  Survived
0    1st  1883  female         1
1    1st  1910  female         0
2    1st  1882    male         0
3    1st  1887  female         0
4    1st  1911    male         1

Контрольные вопросы  

1.Какие две главные структуры данных используются в pandas? В чем их отличие?

Две главные структуры данных, используемые в pandas: Series и Dataframes.  
Series — это структура, используемая для работы с последовательностью одномерных данных.  
Dataframe — это табличная структура данных, позволяющая использовать многомерные Series.Dataframe состоит из упорядоченной коллекции колонок, каждая из которых содержит значение разных типов.

2.Назовите основные функции чтения данных из файлов
* read_csv()
* read_pickle()
* read_table()
* read_fwf()
* read_excel()
* read_html()
* read_xml()
* read_hdf()
* read_sql()

3.Напишите функцию записи набора данных А в файл с разделителями-запятыми  

A.to_csv('A.csv')

4.Как называется функция, выводящая на экран первые N строчек набора данных?  

df.head(N)

5.С помощью какой функции можно удалить поле набора данных? А строку?

Удаление происходит с помощью функции drop, а строка это или столбец зависит от оси axis. Например:  
Удаление поля 'columnName': df.drop('columnName', axis=1)  
Удаление строк 1 и 8: df.drop([1, 8], axis=0)

6.Напишите участок кода, демонстрирующий возможность добавления новой строки к набору данных.

In [18]:
titanic = titanic.append({'PClass':'1st', 'YearOfBirth':'1900', 'Sex':'male', 'Survived':'1'}, ignore_index=True)
titanic.tail(3)

     PClass YearOfBirth   Sex Survived
1311    3rd        1888  male        0
1312    3rd        1883  male        0
1313    1st        1900  male        1

7.Напишите участок кода, демонстрирующий возможность добавления новой колонки (поля) к набору данных.

In [19]:
titanic['Ticket'] = np.random.randint(111111, 999999, size=(titanic.shape[0],1))
titanic.head()

  PClass YearOfBirth     Sex Survived  Ticket
0    1st        1883  female        1  220511
1    1st        1910  female        0  238547
2    1st        1882    male        0  322173
3    1st        1887  female        0  743654
4    1st        1911    male        1  155752